fast_finish_2026/LR7/webapp/runs/smoke-2026-09-13T00-00-00Z/case/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
runApplication setFields
runApplication foamRun
./createGraphs

#------------------------------------------------------------------------------
